test-3/tests/load-test-sqlite.yml
# Updated load-test-sqlite.yml
config:
  target: "http://localhost:5002"
  phases:
    - duration: 60
      arrivalRate: 10

scenarios:
  - flow:
      - post:
          url: "/register"
          form:
            name: "TestUser{{ $randomInt(1000,9999) }}"
            email: "test{{ $randomInt(1000,9999) }}@example.com"
            age: "25"
            distance: "10K"
            medical: ""